EDT/УТ/src/AccumulationRegisters/ОстаткиЗаказов/ОстаткиЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиЗаказов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПрод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЗакуп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТерминалПриема</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/ОстаткиЗаказов/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	             
	
	// тут при отмене проведения проверяем нет ли потенциальных движений по заказам в других документах
	
	
	Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЗакрытиеЗаказов") 
		ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.ГрупповаяУстановкаСтатусовСкладскогоУчета")
		ИЛИ ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаЗаписейРегистров") Тогда
	
			
	Иначе
		
		// тут сворачиваем записи: выбираем все записи по заказам из набора и сравниваем с записями набора, недостающие записываем.
		НаборТЗ = ЭтотОбъект.Выгрузить();
		Если НаборТЗ.Количество() Тогда	
					
			//Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	НаборТЗ.Регистратор КАК Регистратор,
			                      |	НаборТЗ.ТерминалПриема КАК ТерминалПриема,
			                      |	НаборТЗ.ТерминалДоставки КАК ТерминалДоставки,
			                      |	НаборТЗ.Склад КАК Склад,
			                      |	НаборТЗ.Заказ КАК Заказ,
			                      |	НаборТЗ.Номенклатура КАК Номенклатура,
			                      |	НаборТЗ.ТипЗаказа КАК ТипЗаказа,
			                      |	НаборТЗ.Организация КАК Организация,
			                      |	НаборТЗ.Период КАК Период,
			                      |	НаборТЗ.СуммаПрод КАК СуммаПрод,
			                      |	НаборТЗ.Количество КАК Количество,
			                      |	НаборТЗ.ВидДвижения КАК ВидДвижения
			                      |ПОМЕСТИТЬ ВТ
			                      |ИЗ
			                      |	&НаборТЗ КАК НаборТЗ
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ
			                      |	ВТ.Регистратор КАК Регистратор,
			                      |	ВТ.ТерминалПриема КАК ТерминалПриема,
			                      |	ВТ.ТерминалДоставки КАК ТерминалДоставки,
			                      |	ВТ.Склад КАК Склад,
			                      |	ВТ.Заказ КАК Заказ,
			                      |	ВТ.Номенклатура КАК Номенклатура,
			                      |	ВТ.ТипЗаказа КАК ТипЗаказа,
			                      |	ВТ.Организация КАК Организация,
			                      |	ВТ.Период КАК Период,
			                      |	ВТ.СуммаПрод КАК СуммаПрод,
			                      |	ВТ.Количество КАК Количество,
			                      |	ВТ.ВидДвижения КАК ВидДвижения
			                      |ПОМЕСТИТЬ ВТ_Набор
			                      |ИЗ
			                      |	ВТ КАК ВТ
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ
			                      |	ОстаткиЗаказов.Период КАК Период,
			                      |	ОстаткиЗаказов.Регистратор КАК Регистратор,
			                      |	ОстаткиЗаказов.ТерминалПриема КАК ТерминалПриема,
			                      |	ОстаткиЗаказов.ТерминалДоставки КАК ТерминалДоставки,
			                      |	ОстаткиЗаказов.Организация КАК Организация,
			                      |	ОстаткиЗаказов.Заказ КАК Заказ,
			                      |	ОстаткиЗаказов.Номенклатура КАК Номенклатура,
			                      |	ОстаткиЗаказов.ТипЗаказа КАК ТипЗаказа,
			                      |	ОстаткиЗаказов.Склад КАК Склад,
			                      |	ОстаткиЗаказов.ВидДвижения КАК ВидДвижения
			                      |ПОМЕСТИТЬ ВТ_Регистр
			                      |ИЗ
			                      |	РегистрНакопления.ОстаткиЗаказов КАК ОстаткиЗаказов
			                      |ГДЕ
			                      |	ОстаткиЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			                      |	И ОстаткиЗаказов.Заказ В
			                      |			(ВЫБРАТЬ
			                      |				ВТ.Заказ
			                      |			ИЗ
			                      |				ВТ КАК ВТ)
			                      |	И ОстаткиЗаказов.Регистратор <> &Регистратор
			                      |
			                      |СГРУППИРОВАТЬ ПО
			                      |	ОстаткиЗаказов.Организация,
			                      |	ОстаткиЗаказов.ТерминалДоставки,
			                      |	ОстаткиЗаказов.Период,
			                      |	ОстаткиЗаказов.Номенклатура,
			                      |	ОстаткиЗаказов.Заказ,
			                      |	ОстаткиЗаказов.Регистратор,
			                      |	ОстаткиЗаказов.ТерминалПриема,
			                      |	ОстаткиЗаказов.ТипЗаказа,
			                      |	ОстаткиЗаказов.Склад,
			                      |	ОстаткиЗаказов.Количество,
			                      |	ОстаткиЗаказов.СуммаПрод,
			                      |	ОстаткиЗаказов.ВидДвижения
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ
			                      |	ВТ_Набор.Регистратор КАК Регистратор,
			                      |	ВТ_Набор.ТерминалПриема КАК ТерминалПриема,
			                      |	ВТ_Набор.ТерминалДоставки КАК ТерминалДоставки,
			                      |	ВТ_Набор.Склад КАК Склад,
			                      |	ВТ_Набор.Заказ КАК Заказ,
			                      |	ВТ_Набор.Номенклатура КАК Номенклатура,
			                      |	ВТ_Набор.ТипЗаказа КАК ТипЗаказа,
			                      |	ВТ_Набор.Организация КАК Организация,
			                      |	ВТ_Набор.Период КАК Период,
			                      |	ВЫБОР
			                      |		КОГДА ВТ_Регистр.Период ЕСТЬ NULL
			                      |			ТОГДА ИСТИНА
			                      |		ИНАЧЕ ЛОЖЬ
			                      |	КОНЕЦ КАК НужнаЗапись,
			                      |	ВТ_Набор.СуммаПрод КАК СуммаПрод,
			                      |	ВТ_Набор.Количество КАК Количество,
			                      |	ВТ_Набор.ВидДвижения КАК ВидДвижения
			                      |ПОМЕСТИТЬ ВТ_Итог
			                      |ИЗ
			                      |	ВТ_Набор КАК ВТ_Набор
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Регистр КАК ВТ_Регистр
			                      |		ПО ВТ_Набор.ТерминалПриема = ВТ_Регистр.ТерминалПриема
			                      |			И ВТ_Набор.ТерминалДоставки = ВТ_Регистр.ТерминалДоставки
			                      |			И ВТ_Набор.Заказ = ВТ_Регистр.Заказ
			                      |			И ВТ_Набор.Номенклатура = ВТ_Регистр.Номенклатура
			                      |			И ВТ_Набор.ТипЗаказа = ВТ_Регистр.ТипЗаказа
			                      |			И ВТ_Набор.Организация = ВТ_Регистр.Организация
			                      |			И ВТ_Набор.Склад = ВТ_Регистр.Склад
			                      |			И ВТ_Набор.ВидДвижения = ВТ_Регистр.ВидДвижения
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ
			                      |	ВТ_Итог.Регистратор КАК Регистратор,
			                      |	ВТ_Итог.ТерминалПриема КАК ТерминалПриема,
			                      |	ВТ_Итог.ТерминалДоставки КАК ТерминалДоставки,
			                      |	ВТ_Итог.Склад КАК Склад,
			                      |	ВТ_Итог.Заказ КАК Заказ,
			                      |	ВТ_Итог.Номенклатура КАК Номенклатура,
			                      |	ВТ_Итог.ТипЗаказа КАК ТипЗаказа,
			                      |	ВТ_Итог.Организация КАК Организация,
			                      |	ВТ_Итог.Период КАК Период,
			                      |	ВТ_Итог.СуммаПрод КАК СуммаПрод,
			                      |	ВТ_Итог.Количество КАК Количество,
			                      |	ВТ_Итог.ВидДвижения КАК ВидДвижения
			                      |ИЗ
			                      |	ВТ_Итог КАК ВТ_Итог
			                      |ГДЕ
			                      |	ВТ_Итог.НужнаЗапись = ИСТИНА");
			Запрос.УстановитьПараметр("НаборТЗ", НаборТЗ);
			Запрос.УстановитьПараметр("Регистратор", Регистратор);
				
			РезТЗ = Запрос.Выполнить().Выгрузить();
			
			РезТЗ.Свернуть("Период,Заказ,Номенклатура,Склад,Организация,Количество,СуммаПрод,ТипЗаказа,ТерминалПриема,ТерминалДоставки,ВидДвижения");
			
			ЭтотОбъект.Загрузить(РезТЗ);
		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ, Замещение)
	
	  
	
КонецПроцедуры
